let a = 1, b = 1;

let c = ++a; // 2
let d = b++; // 1

alert(`c = ${c}`);
alert(`d = ${d}`);

let e = 2;

let x = 1 + (e *= 2); // e == 4, x == 5

alert(`e = ${e}`);
alert(`x = ${x}`);

"" + 1 + 0		// "10"	문자열
"" - 1 + 0		// -1
true + false	// 1
6 / "3"			// 2
"2" * "3"		// 6
4 + 5 + "px"	// "9px"
"$" + 4 + 5		// "$45"
"4" - 2			// 2
"4px" - 2		// NaN
7 / 0			// inf
"  -9  " + 5	// "  -9  5"
"  -9  " - 5	// -14
null + 1		// 1	숫자형으로 변환시 null은 0
undefined + 1	// NaN	숫자형으로 변환시 undefined는 NaN
" \t \n" - 2	// -2	문자열을 숫자형으로 변환시 공백은 삭제, 길이가 0인 문자열은 0